[
  {
    "_id": "an-elegant-puzzle-systems-of-engineering-management",
    "title": "An Elegant Puzzle: Systems of Engineering Management",
    "description": "<p>There’s a saying that people don’t leave companies, they leave managers. Management is a key part of any organization, yet the discipline is often self-taught and unstructured. Getting to the good solutions for complex management challenges can make the difference between fulfillment and frustration for teams, and, ultimately, between the success and failure of companies.</p><p>Will Larson’s An Elegant Puzzle focuses on the particular challenges of engineering management—from sizing teams to handling technical debt to performing succession planning—and provides a path to the good solutions. Drawing from his experience at Digg, Uber, and Stripe, Larson has developed a thoughtful approach to engineering management for leaders of all levels at companies of all sizes. An Elegant Puzzle balances structured principles and human-centric thinking to help any leader create more effective and rewarding organizations for engineers to thrive in.</p>",
    "authors": ["Will Larson"],
    "pictureUrl": "https://m.media-amazon.com/images/I/51aTO3pGp9L.jpg",
    "price": 4.4
  },
  {
    "id": "become-an-effective-software-engineering-manager-how-to-be-the-leader-your-development-team-needs",
    "title": "Become an Effective Software Engineering Manager: How to Be the Leader Your Development Team Needs",
    "description": "<p>Software startups make global headlines every day. As technology companies succeed and grow, so do their engineering departments. In your career, you'll may suddenly get the opportunity to lead teams: to become a manager. But this is often uncharted territory. How can you decide whether this career move is right for you? And if you do, what do you need to learn to succeed? Where do you start? How do you know that you're doing it right? What does \"it\" even mean? And isn't management a dirty word? This book will share the secrets you need to know to manage engineers successfully.</p>",
    "authors": ["James Stanier"],
    "pictureUrl": "https://images-na.ssl-images-amazon.com/images/I/51B56axRbDL._SX404_BO1,204,203,200_.jpg",
    "price": 39.99
  },
  {
    "id": "the-managers-path-a-guide-for-tech-leaders-navigating-growth-and-change",
    "title": "The Manager's Path: A Guide for Tech Leaders Navigating Growth and Change",
    "description": "<p>Managing people is difficult wherever you work. But in the tech industry, where management is also a technical discipline, the learning curve can be brutal—especially when there are few tools, texts, and frameworks to help you. In this practical guide, author Camille Fournier (tech lead turned CTO) takes you through each stage in the journey from engineer to technical manager.</p><p>From mentoring interns to working with senior staff, you’ll get actionable advice for approaching various obstacles in your path. This book is ideal whether you’re a new manager, a mentor, or a more experienced leader looking for fresh advice. Pick up this book and learn how to become a better manager and leader in your organization.</p>",
    "authors": ["Camille Fournier"],
    "pictureUrl": "https://images-na.ssl-images-amazon.com/images/I/51BHEtpF4eL._SX331_BO1,204,203,200_.jpg",
    "price": 9.92
  },
  {
    "id": "resilient-management",
    "title": "Resilient Management",
    "description": "<p>Finding your bearings as a manager can feel overwhelming—but you don’t have to fake it to make it, and you don’t have to go it alone. Lara Hogan shares her recipe for supporting and leading a tech team—from developing your mentoring and coaching skills, to getting comfortable with having difficult conversations, to boosting trust among teammates—while staying grounded along the way.</p>",
    "authors": ["Lara Callender Hogan"],
    "pictureUrl": "https://resilient-management.com/css/cover-200.png",
    "price": 15
  },
  {
    "id": "managing-humans-biting-and-humorous-tales-of-a-software-engineering-manager",
    "title": "Managing Humans: Biting and Humorous Tales of a Software Engineering Manager",
    "description": "<p>Read hilarious stories with serious lessons that Michael Lopp extracts from his varied and sometimes bizarre experiences as a manager at Apple, Pinterest, Palantir, Netscape, Symantec, Slack, and Borland. Many of the stories first appeared in primitive form in Lopp’s perennially popular blog, Rands in Repose. The Third Edition of Managing Humans contains a whole new season of episodes from the ongoing saga of Lopp's adventures in Silicon Valley, together with classic episodes remastered for high fidelity and freshness.</p><p>Whether you're an aspiring manager, a current manager, or just wondering what the heck a manager does all day, there is a story in this book that will speak to you—and help you survive and prosper amid the general craziness of dysfunctional bright people caught up in the chase of riches and power. Scattered in repose among these manic misfits are managers, an even stranger breed of people who, through a mystical organizational ritual, have been given power over the futures and the bank accounts of many others.</p><p>Lopp's straight-from-the-hip style is unlike that of any other writer on management and leadership. He pulls no punches and tells stories he probably shouldn't. But they are magically instructive and yield Lopp’s trenchant insights on leadership that cut to the heart of the matter—whether it's dealing with your boss, handling a slacker, hiring top guns, or seeing a knotty project through to completion.</p>",
    "authors": ["Michael Lopp"],
    "pictureUrl": "https://images-na.ssl-images-amazon.com/images/I/51Bc9s32NUL._SX328_BO1,204,203,200_.jpg",
    "price": 28.15
  },
  {
    "id": ""
  }
]
